# Tap
# Sketchybar and Borders
## tap "FelixKratz/formulae"

# Window
cask "nikitabobko/tap/aerospace"
# brew "sketchybar"
# brew "borders"

# Basic
brew "mas" # Mac App Store CLI
brew "git"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "tree"
brew "bat"
brew "lsd"
brew "stow"
brew "jq"
brew "yq"
brew "gh"
brew "btop"
brew "coreutils"
brew "fastfetch"
brew "nushell"
brew "tealdeer"
brew "tmux"
brew "zoxide"
brew "atuin"
brew "neovim"
brew "luarocks"
brew "mise"
brew "poppler"
brew "ffmpeg"
brew "resvg"
brew "imagemagick"
brew "sevenzip"
brew "yazi"
brew "libqalculate"
# brew "switchaudio-osx"
# brew "kanata"
brew "cmake"
brew "just"
brew "git-delta"
brew "starship"
brew "readline"
brew "asciinema"
brew "agg" # Convert asciinema cast to gif
brew "asciiquarium"
brew "markdown"
brew "cmatrix"
brew "cbonsai"
brew "harper" # Grammerly-like
brew "sqlc"
brew "pre-commit"

brew "hugo"

# Games
brew "nethack"

# CPP
brew "llvm"
brew "clang-format"

# Rust
brew "rustup"
brew "rust"

# Python
brew "ruff"
brew "basedpyright"

# Golang
brew "golang"

# Zathura (https://github.com/homebrew-zathura/homebrew-zathura)
# tap "homebrew-zathura/zathura"
# brew "zathura --with-synctex"
# brew "[zathura-pdf-mupdf]"

# LSP, Linter, Formatter, Debugger

# CMAKE
brew "cmake-language-server"

# Shell
brew "shfmt"
brew "shellcheck"
 
# Lua
brew "lua-language-server"
brew "luacheck"
brew "stylua"
#

# ZSH Plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

# Casks
cask "ghostty"
# cask "raycast"
cask "firefox@developer-edition"
cask "linearmouse"
# cask "betterdisplay"
# cask "sf-symbols"
cask "calibre"
# cask "hyperkey"
# cask "raindropio"
# cask "karabiner-elements"
# cask "element"
cask "skim"
cask "shortcat"
# cask "appcleaner"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-aporetic"
cask "font-symbols-only-nerd-font"

# AI
brew "codex"
cask "claude-code"
